/**************************** Copyright (c) ****************************************
**                                                                
****************************File Information****************************************
**文   件   名: RotateApp.c
**创   建   人: 赖 浩
**创 建 日  期: 2014年4月3日
**最后修改日期:
**描        述: 卡盒旋转处理头文件							
************************************************************************************/
#define     _NUMERICDISPLAY_APP_H_


void Display_PortInit(void);
/*****************************************************************************************
* 名	称：Display_WriteByte()
* 功	能：向数码管某一位写一个数据，用于显示
* 入口参数：PositionAddr 位地址，Byte 写的数据，即显示的数据，FixedPoint 显示的数据是否需要小数点。
* 出口参数：无
* 说	明：往某个扩展串口的某个寄存器写一个字节数据
******************************************************************************************/
void Display_WriteByte(uint16 PositionAddr, uint16 Byte, uint8 FixedPoint);

void KeysScan(void);

void GainKeyValue(void);

void DisplayTest(uint16 TestData);

/****************************************************************************
* 名	称：NumericDisplayVariInit()
* 功	能：
* 入口参数：
* 出口参数：
* 说	明：数码管显示变量初始化
****************************************************************************/
void DisplayVariInit(void);

/****************************************************************************
* 名	称：WaitSampleEvent()
* 功	能：等待采样信号
* 入口参数：无
* 出口参数：无
* 说	明：
****************************************************************************/
void WaitNumericDisplayEvent(void);

/****************************************************************************
* 名	称：PostSampleSem()
* 功	能：发送电机旋转信号
* 入口参数：无
* 出口参数：
* 说	明：
****************************************************************************/
void PostNumericDisplaySem(void);

/****************************************************************************
* 名	称：TIM4Start()
* 功	能：
* 入口参数：
* 出口参数：无
* 说	明：定时器4启动
****************************************************************************/
void TIM4Start(void);

/****************************************************************************
* 名	称：TIM4Stop()
* 功	能：
* 入口参数：
* 出口参数：无
* 说	明：定时器4停止
****************************************************************************/
void TIM4Stop(void);

/****************************************************************************
* 名	称：Timer3ResetRun()
* 功	能：定时器3复位并运行
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
void TIM4ResetRun(void);

/****************************************************************************
* 名	称：Timer3Init()
* 功	能：
* 入口参数：
* 出口参数：无
* 说	明：无
****************************************************************************/
void TIM4_Init(void);

/****************************************************************************
* 名	称：NumericDisplayProcess()
* 功	能：卡盒旋转处理线程
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/ 
void DisplayProcess(void) reentrant;


/******************************** END OF FILE *******************************/
